app/views/servicios/new.html.erb

SELECT "comunas".* FROM "comunas"
---
        <%=form.label :Comuna, style: "color:black"%>
        <%= form.collection_select :comuna, Comuna.all, :id, :nombre %>