app/views/carretes/new.html.erb

        <%=form.label :Comuna, style: "color:black"%>
        <%= form.collection_select :comuna, Comuna.all, :id, :nombre %>
---
SELECT "comunas".* FROM "comunas"


    <% @servicios = Servicio.all %>
---
SELECT "servicios".* FROM "servicios"