app/views/operates/new.html.erb

        <%=form.label :servicio%>
        <%= form.collection_select :id_servicio, Servicio.all, :id, :nombre %>
---
SELECT "servicios".* FROM "servicios"

        <%=form.label :comuna%>
        <%= form.collection_select :id_lugar, Comuna.all, :id, :nombre %>
---
SELECT "comunas".* FROM "comunas"