app/views/contratos/new.html.erb

SELECT "carretes".* FROM "carretes"
---
        <% carretes_user = [] %>
        <% carretes = Carrete.all %>