app/controllers/carretes_controller.rb

  def index
    @carretes = Carrete.all
---
SELECT "carretes".* FROM "carretes"

  def show
    @carrete = Carrete.find(params[:id])
---
SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]