app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
    @servicio = Servicio.find(params[:id])
---
SELECT "comentarios".* FROM "comentarios"
SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @comentario = Comentario.new
    @servicio = Servicio.find(params[:id])
---
SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]