app/controllers/comentario_carretes_controller.rb

  def index
    @comentario_carretes = ComentarioCarrete.all
    @carrete = Carrete.find(params[:id])
---
SELECT "comentario_carretes".* FROM "comentario_carretes"
SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @comentario_carrete = ComentarioCarrete.new
    @carrete = Carrete.find(params[:id])
---
SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @comentario_carrete = ComentarioCarrete.find(params[:id])
---
SELECT  "comentario_carretes".* FROM "comentario_carretes" WHERE "comentario_carretes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]