app/controllers/comunas_controller.rb

SELECT "comunas".* FROM "comunas"
---
  def index
    @comunas = Comuna.all

SELECT  "comunas".* FROM "comunas" WHERE "comunas"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @comuna = Comuna.find(params[:id])