app/controllers/contratos_controller.rb

  def index
    @contratos = Contrato.all
---
SELECT "contratos".* FROM "contratos"

  def show
    @contrato = Contrato.find(params[:id])
---
SELECT  "contratos".* FROM "contratos" WHERE "contratos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]