app/controllers/oferts_controller.rb

SELECT "oferts".* FROM "oferts"
SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @oferts = Ofert.all
    @carrete = Carrete.find(params[:id])

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @ofert = Ofert.new
    @carrete = Carrete.find(params[:id])

SELECT  "oferts".* FROM "oferts" WHERE "oferts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @ofert = Ofert.find(params[:id])