app/controllers/operates_controller.rb

  def show
    @operate = Operate.find(params[:id])
---
SELECT  "operates".* FROM "operates" WHERE "operates"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]