app/controllers/servicios_controller.rb

  def index
    @servicios = Servicio.all
---
SELECT "servicios".* FROM "servicios"

  def show
    @servicio = Servicio.find(params[:id])
---
SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]