app/controllers/valoracion_servicios_controller.rb

  def index
    @valoracion_servicios = ValoracionServicio.all
    @servicio = Servicio.find(params[:id])
---
SELECT "valoracion_servicios".* FROM "valoracion_servicios"
SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @valoracion_servicio = ValoracionServicio.new
    @servicio = Servicio.find(params[:id])
---
SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @valoracion_servicio = ValoracionServicio.find(params[:id])
---
SELECT  "valoracion_servicios".* FROM "valoracion_servicios" WHERE "valoracion_servicios"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]