app/controllers/valoracion_carretes_controller.rb

SELECT "valoracion_carretes".* FROM "valoracion_carretes"
SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @valoracion_carretes = ValoracionCarrete.all
    @carrete = Carrete.find(params[:id])

SELECT  "carretes".* FROM "carretes" WHERE "carretes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @valoracion_carrete = ValoracionCarrete.new
    @carrete = Carrete.find(params[:id])

SELECT  "valoracion_carretes".* FROM "valoracion_carretes" WHERE "valoracion_carretes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @valoracion_carrete = ValoracionCarrete.find(params[:id])